Repository: KDE/kdiamond
Catalog: po/*/kdiamond.po
Languages: eo, th

# NAME OF TRANSLATORS
source: Your names
eo: Axel Rousseau, Oliver Kellogg
th: ถนอมทรัพย์ นพบูรณ์

# EMAIL OF TRANSLATORS
source: Your emails
eo: axel@esperanto-jeunes.org, olivermkellogg@gmail.com
th: donga.nb@gmail.com

source: Click the pause button again to resume the game.
eo: Klaku la paŭzbutonon refoje por resumi la ludon.
th: คลิกที่ปุ่มหยุดชั่วคราวอีกครั้ง เพื่อกลับมาเล่นเกมต่อ

# Not meant like 'You have lost', more like 'Time is up'.
source: Game over.
eo: Ludo finita.
th: จบเกม

source: Possible moves: %1
eo: Eblaj movoj: %1
th: จำนวนการย้ายที่เป็นไปได้: %1

source: Points: %1
eo: Poentoj: %1
th: คะแนน: %1

source: Untimed game
eo: Netempigita ludo
th: เกมที่ไม่จับเวลา

source: Time left: %1
eo: Tempo restanta: %1
th: เหลือเวลาอีก: %1

# Shown when the board is in motion.
source: Possible moves: …
eo: Eblaj movoj: …

source: Play an untimed game.
eo: Komenci netempigitan ludon.
th: เล่นเกมที่ไม่จับเวลา

source: Main Toolbar
eo: Ĉefa ilobreto
th: แถบเครื่องมือหลัก

source: KDiamond, a three-in-a-row game.
eo: KDiamond, tri-en-vica ludo.
th: เกมเพชร-K , เกมสลับให้เรียงครบอย่างน้อยสามสีในแถวเดียวกัน

source: (C) 2008-2010 Stefan Majewsky and others
eo: (C) 2008-2010 Stefan Majewsky kaj aliaj

source: Original author and current maintainer
eo: Origina aŭtoro kaj aktuala prizorganto
th: ผู้เขียนแรกเริ่มและผู้ดูแลปัจจุบัน

source: Gameplay refinement
eo: Ludreĝima rafinado
th: ช่วยปรับความละเอียดของการเล่น

source: Default theme
eo: Defaŭlta etoso
th: ธีมปริยาย

source: Classic theme
eo: Klasika etoso
th: ธีมคลาสสิก

source: Technical consultant
eo: Teknika konsilanto
th: ที่ปรึกษาด้านเทคนิค

# @title:menu new game
source: &New
eo: &Nova

# @item:inmenu
source: Timed Game
eo: Tempigita Ludo

# @item:inmenu
source: Untimed Game
eo: Netempigita Ludo

# @info:tooltip
source: Start a new game
eo: Komenci novan ludon

# @info:whatsthis
source: Starts a new game.
eo: Komencas novan ludon.

source: Untimed
eo: Netempigita
th: ไม่จับเวลา

source: Timed
eo: Tempigita
th: จับเวลา

source: Mode
eo: Reĝimo
th: โหมด

source: <h3>Rules of Game</h3><p>Your goal is to assemble lines of at least three similar diamonds. Click on two adjacent diamonds to swap them.</p><p>Earn extra points by building cascades, and extra seconds by assembling big lines or multiple lines at one time.</p>
eo: <h3>Reguloj de Ludo</h3><p>Via eclo estas kunmeti liniojn de almenaŭ tri similaj diamantoj. Klaku sur du apudaj diamantoj por interŝanĝi ilin.</p><p>Gajnu ekstrajn poentojn konstruante kaskadojn kaj gajnu ekstrajn sekundojn kunmetante grandajn aŭ multoblajn liniojn je sama tempo.</p>
th: <h3>กฎการเล่น</h3><p>เป้าหมายของคุณคือ พยายามจัดเรียงหมากสีในแถวเดียวกัน ให้ได้อย่างน้อยสามตัวหมาก คลิกบนตัวหมากที่ติดกันเพื่อสลับตัวหมาก</p><p>หาคะแนนพิเศษ ด้วยการพยายามทำให้ตัวหมากหล่นลงมามาก ๆ และคะแนนพิเศษจากการเรียงสีให้มีความยาวมาก ๆ หรือได้หลาย ๆ แถวในคราวเดียว</p>

# The application's name
source: KDiamond
th: เกมเพชร-K
